# IsValidAlternatingBarOrientation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathReinforcement..::..IsValidAlternatingBarOrientation Method
PathReinforcement Class See Also
---
Checks if orientation for alternating bars is valid.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValidAlternatingBarOrientation(
	ReinforcementBarOrientation orientation
)
```

Visual Basic
---
```text
Public Function IsValidAlternatingBarOrientation ( _
	orientation As ReinforcementBarOrientation _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidAlternatingBarOrientation(
	ReinforcementBarOrientation orientation
)
```

# ### Parameters
orientation
    Type: Autodesk.Revit.DB.Structure..::..ReinforcementBarOrientation An orientation.
# ### Return Value
True if orientation for alternating bars are valid.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace